<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>Listas | Introduction</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="../gitbook/style.css">
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-katex/katex.min.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="../gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    
    <link rel="prev" href="../listas/index.html" />
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="3.1"
        data-chapter-title="Listas"
        data-filepath="listas/listas.md"
        data-basepath=".."
        data-revision="Thu Mar 31 2016 19:18:39 GMT-0300 (CLT)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter " data-level="0" data-path="index.html">
            
                
                    <a href="../index.html">
                
                        <i class="fa fa-check"></i>
                        
                        Introduction
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="intro/index.html">
            
                
                    <a href="../intro/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        Introducción
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1" data-path="intro/declarativa.html">
            
                
                    <a href="../intro/declarativa.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.1.</b>
                        
                        La programación declarativa
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="intro/funcional.html">
            
                
                    <a href="../intro/funcional.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.2.</b>
                        
                        Definiendo el paradigma funcional
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2" data-path="invariante/index.html">
            
                
                    <a href="../invariante/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        Recursión y programación invariante
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="invariante/fundamentos.html">
            
                
                    <a href="../invariante/fundamentos.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        Programación invariante: fundamentos
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="invariante/invariante-real.html">
            
                
                    <a href="../invariante/invariante-real.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        Programación invariante en el mundo real
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="3" data-path="listas/index.html">
            
                
                    <a href="../listas/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        Listas y correspondencia de patrones
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="3.1" data-path="listas/listas.html">
            
                
                    <a href="../listas/listas.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.1.</b>
                        
                        Listas
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../" >Introduction</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h1 id="listas">Listas</h1>
<p>En la secci&#xF3;n anterior vimos c&#xF3;mo usar la programaci&#xF3;n invariante para crear
bucles que realizaran c&#xE1;lculos con enteros. Los enteros, sin embargo, son
un tipo de dato bastante simple. En muchos casos vamos a querer realizar c&#xE1;lculos
con grandes cantidades de datos, con grandes cantidades de enteros, por ejemplo.
Y en esos casos vamos a necesitar algo que llamamos tipos de datos compuestos.
Entre los tipos de datos compuestos m&#xE1;s simples se encuentran las listas. Las listas
son b&#xE1;sicamente secuencias ordenadas de elementos. Fueron inventadas en el lenguaje
de programaci&#xF3;n LISP en los a&#xF1;os 50, y desde entonces, son una parte esencial de
la programaci&#xF3;n simb&#xF3;lica, de modo que la mayor&#xED;a de los lenguajes simb&#xF3;licos
las soportan. En definitiva, claramente no es suficiente con saber implementar
las t&#xE9;cnicas como la programaci&#xF3;n invariante a tipos de datos simples como los enteros.
En esta secci&#xF3;n, por lo tanto, nos dedicaremos a ampliar nuestra capacidad de trabajo
hacia tipos de datos compuestos comenzando con uno de los m&#xE1;s simples y comunes: las listas.
Aunque no creas que por ser una de las estructuras de datos m&#xE1;s sencillas, sean estrictamente simples.
Se ven simples, pero de hecho, tienen algunas sutilezas. Las listas, en realidad,
son una estructura de datos recursiva. Y si escribes programas que usen listas,
tienes que respetar su estructura recursiva. As&#xED; que, de nuevo,
no son tan simples como las hacen ver la definici&#xF3;n acotada y cl&#xE1;sica que dimos
m&#xE1;s arriba. De modo que hay una definici&#xF3;n m&#xE1;s precisa de qu&#xE9; son las listas, y
de c&#xF3;mo, por ejemplo, podemos recorrerlas si queremos escribir programas que
calculen con ellas. Revisemos estas definiciones.</p>
<p><strong>Nota</strong>: LISP, de hecho, es una abreviaci&#xF3;n de List Processor (procesador de listas).</p>
<p><strong>Nota2</strong>: Un <em>lenguaje simb&#xF3;lico</em> es un lenguaje que tiene soporte especial para
realizar c&#xE1;lculos con datos que no sean n&#xFA;meros, por ejemplo, con datos como
listas, &#xE1;rboles, grafos, y otros datos no num&#xE9;ricos.</p>
<h3 id="definiendo-las-listas-con-el-uso-de-reglas-gram&#xE1;ticales">Definiendo las listas con el uso de reglas gram&#xE1;ticales</h3>
<p>Una lista es un tipo de dato <em>recursivo</em>. Esto significa que su definici&#xF3;n est&#xE1; dada
en t&#xE9;rminos de s&#xED; misma. La recursi&#xF3;n, de hecho, no es algo exclusivo de las
computaciones, sino que tambi&#xE9;n puede ser una propiedad de los datos. Lo anterior
es importante tenerlo en cuenta cuando escribimos funciones dirigidas a trabajar
con listas, ya que estas funciones tambi&#xE9;n ser&#xE1;n recursivas y, de hecho, van a
seguir la estructura recursiva dada por su definici&#xF3;n, de modo que se ajustan
perfectamente. Dicho esto, &#xBF;C&#xF3;mo es que definimos a una lista?, del siguiente modo:</p>
<blockquote>
<p>Una lista es ya sea una lista vac&#xED;a o un par compuesto de un elemento seguido de otra lista</p>
</blockquote>
<p>Como hab&#xED;amos adelantado, su definici&#xF3;n es recursiva. Una lista se define en
t&#xE9;rminos de listas, y no hay regresi&#xF3;n infinita pues la usaremos de forma constructiva,
para construir listas m&#xE1;s grandes a partir de otras m&#xE1;s peque&#xF1;as, comenzando con
una vac&#xED;a. Bueno, siendo m&#xE1;s precisos, eso es una lista. Ahora, en t&#xE9;rminos formales,
con esa s&#xF3;la definici&#xF3;n no basta. A&#xFA;n nos queda definir su sintaxis y su sem&#xE1;ntica.
Estas dos definiciones son un aspecto muy relevante en la definici&#xF3;n formal de
cualquier estructura de dato. Bien, definamos primero su sintaxis, es decir, su
representaci&#xF3;n textual. Para ello vamos a usar lo que se conoce como una
<em>regla gram&#xE1;tical EBNF</em>. EBNF son las siglas para Extended Backus-Naur Form, o en
espa&#xF1;ol, para Notaci&#xF3;n de Backus-Naur extendida. Esta es una forma muy popular para
definir sintaxis inventada por John Backus y Peter Naur hace 50 a&#xF1;os atr&#xE1;s. Usando
esta regla escribimos:</p>
<p><span class="katex-display"><span class="katex"><span class="katex-mathml"><math><semantics><mrow><mo>&lt;</mo><mtext><mi mathvariant="normal">L</mi><mi mathvariant="normal">i</mi><mi mathvariant="normal">s</mi><mi mathvariant="normal">t</mi><mtext>&#xA0;</mtext><mi mathvariant="normal">T</mi></mtext><mo>&gt;</mo><mo>:</mo><mo>:</mo><mo>=</mo><mtext><mi mathvariant="normal">n</mi><mi mathvariant="normal">i</mi><mi mathvariant="normal">l</mi><mtext>&#xA0;</mtext></mtext><mi mathvariant="normal">&#x2223;</mi><msup><mtext><mtext>&#xA0;</mtext><mi mathvariant="normal">T</mi><mtext>&#xA0;</mtext></mtext><mrow><mi mathvariant="normal">&#x2032;</mi></mrow></msup><msup><mi mathvariant="normal">&#x2223;</mi><mrow><mi mathvariant="normal">&#x2032;</mi></mrow></msup><mo>&lt;</mo><mtext><mi mathvariant="normal">L</mi><mi mathvariant="normal">i</mi><mi mathvariant="normal">s</mi><mi mathvariant="normal">t</mi><mtext>&#xA0;</mtext><mi mathvariant="normal">T</mi></mtext><mo>&gt;</mo></mrow><annotation encoding="application/x-tex">
&lt;\text{List T}&gt; ::= \text{nil } | \text{ T } &apos;|&apos; &lt;\text{List T}&gt;
</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.801892em;"></span><span class="strut bottom" style="height:1.051892em;vertical-align:-0.25em;"></span><span class="base displaystyle textstyle uncramped"><span class="mrel">&lt;</span><span class="text mord displaystyle textstyle uncramped"><span class="mord mathrm">L</span><span class="mord mathrm">i</span><span class="mord mathrm">s</span><span class="mord mathrm">t</span><span class="mord mspace">&#xA0;</span><span class="mord mathrm">T</span></span><span class="mrel">&gt;</span><span class="mrel">:</span><span class="mrel">:</span><span class="mrel">=</span><span class="text mord displaystyle textstyle uncramped"><span class="mord mathrm">n</span><span class="mord mathrm">i</span><span class="mord mathrm">l</span><span class="mord mspace">&#xA0;</span></span><span class="mord mathrm">&#x2223;</span><span class="mord"><span class="text mord displaystyle textstyle uncramped"><span class="mord mspace">&#xA0;</span><span class="mord mathrm">T</span><span class="mord mspace">&#xA0;</span></span><span class="vlist"><span style="top:-0.413em;margin-right:0.05em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped"><span class="mord scriptstyle uncramped"><span class="mord mathrm">&#x2032;</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mord"><span class="mord mathrm">&#x2223;</span><span class="vlist"><span style="top:-0.413em;margin-right:0.05em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped"><span class="mord scriptstyle uncramped"><span class="mord mathrm">&#x2032;</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mrel">&lt;</span><span class="text mord displaystyle textstyle uncramped"><span class="mord mathrm">L</span><span class="mord mathrm">i</span><span class="mord mathrm">s</span><span class="mord mathrm">t</span><span class="mord mspace">&#xA0;</span><span class="mord mathrm">T</span></span><span class="mrel">&gt;</span></span></span></span></span></p>
<p>Se puede ver algo complicado, pero es cosa de entender el significado de cada
uno de los elementos que componen la expresi&#xF3;n. En esta regla, <code>List T</code> representa a una lista
de elementos de tipo <code>T</code>. El <code>::=</code> es una notaci&#xF3;n para representar la expresi&#xF3;n &#xAB;se define como&#xBB;.
Luego, <code>nil</code> es la forma en que se representan a las listas vac&#xED;as. La barra vertical <code>|</code>
significa el conector l&#xF3;gico &#xAB;o&#xBB;. La <code>T</code>, un elemento de tipo <code>T</code>. Y finalmente, una
barra vertical entre comillas representa a <code>|</code>, pero con el significado de la sintaxis que estamos
definiendo (que va depender del lenguaje). En este caso, representa a un operador
que define a un par compuesto de las dos partes que aparecen a sus lados. Resumiendo
todo lo anterior, podemos leer la expresi&#xF3;n anterior como: &#xAB;una lista de elementos de tipo T
se define como una lista vac&#xED;a o un par compuesto de un elemento de tipo T y otra
lista de elementos de tipo T&#xBB;. Exactamente la misma definici&#xF3;n que dimos antes.</p>
<p><strong>Nota</strong>: <code>nil</code> y el <code>|</code> entre comillas no son parte de la notaci&#xF3;n ENBF, sino elementos que
definimos en la sintaxis de nuestro lenguaje. En este ejemplo se usa la sintaxis
del lenguaje Oz para representar a una lista vac&#xED;a, y a un elemento seguido de otro.
La misma definici&#xF3;n anterior se puede llevar a otro lenguaje, y en ese caso habr&#xED;a
que reemplazar <code>nil</code> y el <code>|</code> entre comillas, por la sintaxis para representar
a una lista vac&#xED;a, y a un elemento seguido de otro, en ese lenguaje en especifico.</p>
<p><strong>Nota2</strong>: Comprendida la nota anterior, no hay que confundir entre el <code>|</code> sin comillas
y el que est&#xE1; entre comillas. El sin comillas es parte de la notaci&#xF3;n ENBF (&#xAB;o&#xBB; l&#xF3;gico),
mientras el otro no, sino que se refiere al significado de <code>|</code> en la sintaxis que
definimos (en este caso, lenguaje Oz). Las comillas justamente est&#xE1;n para distinguir
entre notaciones del ENBF y las definidas por un lenguaje en especifico cuando se
representan del mismo modo.</p>
<p>Siguiendo la definici&#xF3;n dada anteriormente podr&#xED;amos definir las siguientes listas
(considerando que <code>T</code> fuera un entero):</p>
<pre><code>nil
10 | nil
10 | 11 | nil
10 | 11 | 12 | nil
</code></pre><p><strong>Nota</strong>: Recuerda que | representa a un elemento seguido de otro en Oz. Usamos aqu&#xED;
esta notaci&#xF3;n por cuestiones de simplificaci&#xF3;n.</p>
<h3 id="notaci&#xF3;n-de-tipo">Notaci&#xF3;n de tipo</h3>
<p>En la definici&#xF3;n dada anteriormente, mencionamos que <code>List T</code> significaba una lista
de elementos de tipo <code>T</code>, pero no mencionamos nada sobre los corchetes angulares (&lt; &gt;) que
le rodeaban. Estos &quot;corchetes&quot; de hecho le dan un giro bastante relevante a su significado.
La idea detr&#xE1;s de esta notaci&#xF3;n est&#xE1; en representar al <em>conjunto de las todas representaciones sint&#xE1;cticas</em> de
un tipo en particular. De modo que lo que en realidad significaba <code>&lt;List T&gt;</code> era <em>el conjunto de todas
las representaciones sint&#xE1;cticas</em> de una lista de elementos de tipo <code>T</code>. Esto, de hecho,
es lo que representa para cualquier otro tipo de dato que rodee. Si tenemos <code>&lt;Int&gt;</code>, m&#xE1;s que
representar a un entero, ser&#xED;a m&#xE1;s preciso decir que identifica al conjunto de todas las representaciones
sint&#xE1;cticas de los enteros. Y si el caso fuera <code>&lt;List &lt;Int&gt;&gt;</code>, entonces estar&#xED;amos ante
el conjunto de todas las representaciones sint&#xE1;cticas de listas de enteros, y as&#xED; en m&#xE1;s.
En adici&#xF3;n a lo anterior, la <code>T</code> m&#xE1;s que representar a un elemento de tipo <code>T</code> en la notaci&#xF3;n
ENBF, representa m&#xE1;s bien al conjunto de todas las representaci&#xF3;n de valores de tipo <code>T</code>.
En este caso, adem&#xE1;s, decimos que <code>T</code> es una <em>variable de tipo</em>, un s&#xED;mbolo para
representar a un tipo cualquiera en particular.</p>
<p><strong>Nota</strong>: Las variables de tipo s&#xF3;lo existen en las reglas gram&#xE1;ticales. No se
deben confundir con las variables de la memoria, o con los identificadores a los que
asociamos esas variables.</p>
<h3 id="no-confundir-una-cosa-y-su-representaci&#xF3;n">No confundir una cosa y su representaci&#xF3;n</h3>
<p>Para finalizar esta secci&#xF3;n dedicada a la definici&#xF3;n de las listas, vale la pena
tomar en cuenta una lecci&#xF3;n muy importante que nos ha dado el pintor surrealista
Rene Magritte. A continuaci&#xF3;n se muestra una pintura muy famosa cuyo t&#xED;tulo es
<em>Ceci n`est une pipe</em> - o en espa&#xF1;ol, esto no es una pipa.</p>
<p><img src="img/Esto-no-es-una-pipa.jpg" alt=""></p>
<p>Y de hecho, definitivamente esta pintura no es una pipa. Alguien le pregunt&#xF3;
a Magritte &#xBF;Si no es una pipa, qu&#xE9; es entonces?&#xBF;En qu&#xE9; sentido no es una pipa?
Y Magritte le dijo, trata de rellenarla con tabaco, y ver&#xE1;s que no es una pipa.
De modo que lo que aqu&#xED; se muestra es una fotograf&#xED;a digital de una pintura de una pipa,
a menos que la imprimas, en cuyo caso ser&#xED;a una versi&#xF3;n impresa de una ...,y etc&#xE9;tera,
etc&#xE9;tera. De forma an&#xE1;loga esto no es un entero:</p>
<p><span class="katex-display"><span class="katex"><span class="katex-mathml"><math><semantics><mrow><mn>1</mn><mn>2</mn><mn>3</mn><mn>4</mn></mrow><annotation encoding="application/x-tex">
1234
</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.64444em;"></span><span class="strut bottom" style="height:0.64444em;vertical-align:0em;"></span><span class="base displaystyle textstyle uncramped"><span class="mord mathrm">1</span><span class="mord mathrm">2</span><span class="mord mathrm">3</span><span class="mord mathrm">4</span></span></span></span></span></p>
<p>Es tan s&#xF3;lo una representaci&#xF3;n visual de un entero usando s&#xED;mbolos num&#xE9;ricos
en base 10.</p>
<p><strong>A tener en cuenta</strong> <br></p>
<p>Utilizando la definici&#xF3;n dada m&#xE1;s arriba &#xBF;Es posible construir una lista circular?</p>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        <a href="../listas/index.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Listas y correspondencia de patrones"><i class="fa fa-angle-left"></i></a>
        
        
    </div>
</div>

        
<script src="../gitbook/app.js"></script>

    
    <script src="../gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="../gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"katex":{},"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
